# 동호는 내년에 초등학교를 입학한다. 그래서 동호 어머니는 수학 선행
# 학습을 위해 쉽게 푸는 문제를 동호에게 주었다.
# 이 문제는 다음과 같다. 1을 한 번, 2를 두 번, 3을 세 번,
# 이런 식으로 1 2 2 3 3 3 4 4 4 4 5 .. 이러한 수열을 만들고
# 어느 일정한 구간을 주면 그 구간의 합을 구하는 것이다.
# 하지만 동호는 현재 더 어려운 문제를 푸느라 바쁘기에 우리가 동호를 도와주자.

# 첫째 줄에 구간의 시작과 끝을 나타내는 정수 A, B(1 ≤ A ≤ B ≤ 1,000)가 주어진다. 
# 즉, 수열에서 A번째 숫자부터 B번째 숫자까지 합을 구하면 된다.

A, B = map(int, input().split())  # A : 시작하는 값의 인덱스
                                  # B : 구간의 끝 값 인덱스
list_num = []                     # 리스트 만들기
for i in range(1,51):             # 1부터 50까지 하면 51*25개 나와서 조건의 1000보다는 긴 리스트
    for a in range(i):            # i번만큼 반복하기위해 for 문 사용
        list_num.append(i)        # i 만큼 더하기
# print(list_num)

print(sum(list_num[A-1:B]))       # sum과 slicing 사용해서 인덱스라서 A가 포함될려면 A-1 부터 B까지