# 쓰레기장에서 출발한 쓰레기차가 여러 지점들을 방문하며 쓰레기를 모으고 있다. 
# 쓰레기차는 쓰레기장에서 가까운 지점부터 방문하며,
# 쓰레기를 모으다가 다음과 같은 경우에 쓰레기장으로 돌아가 싣고 있는 쓰레기를 비운다.
#     1.쓰레기의 양이 용량에 도달했을 때.
#     2.그 지점의 쓰레기를 실었을 때 쓰레기차의 용량을 넘게 될 때.
#     3.더 이상 쓰레기를 실을 지점이 없을 때.
# 쓰레기 모으기는 쓰레기차가 모든 지점의 쓰레기를 수거하여 쓰레기장에 도달했을 때 끝난다. 
# 또한, 쓰레기차가 특정 지점에서 쓰레기를 실을 때는 한 번에 모두 실어야 한다.
# (즉, 쓰레기의 일부를 싣고 쓰레기장에 다녀온 뒤 나머지를 싣는 것은 허용되지 않는다.)
# 쓰레기차의 용량과 각 지점의 위치와 쓰레기의 양이 주어졌을 때,
#  위의 방법처럼 쓰레기차가 모든 쓰레기들을 쓰레기장에 수거했을 때 쓰레기차의 총 이동 거리를 구하자.

# 입력의 첫 번째 줄에는 테스트 케이스의 수 T가 주어진다.
# 각 테스트 케이스의 첫 번째 줄에는 쓰레기차의 용량 W와 지점의 개수 N이 주어진다.
#  (1 <= W <= 1000, 1 <= N <= 1000)
# 다음 N개의 줄에는 i번째 지점의 쓰레기장으로부터의 거리 x_i와 쓰레기의 양 w_i가 주어진다.
# 각 지점의 x_i는 서로 다르며 x_i가 작은 지점부터 순서대로 입력이 주어진다. 
# (0 <= x_i <= 100000, 1 <= w_i <= W) 모든 지점은 일직선 상에 있다.

T = int(input())
for _ in range(T):
    W, N = map(int , input().split()) 
    x = [0]*N
    w = [0]*N
    dis = 0                                    # 거리
    limit = W                                  # 용량한계
    for i in range(N):                          
        x[i],w[i] = map(int , input().split()) # 각지점 거리 쓰레기양
        
    i = 0                                      # 지점의 인덱스
    while i < N :                               
        if limit == w[i]:        # 쓰레기 용량이 한계와 같을때 
            dis += x[i] * 2      # 그지점까지의 거리 곱 2
            i += 1               # 인덱스 추가
            limit = W            # 다시 돌아갓다와서 비어있으므로 용량 그대로

        elif limit > w[i] :      # 쓰레기 용량이  쓰레기 양보다 클때
            limit = limit - w[i] # 남은 용량으로 바꾸기
            i += 1               # 다음 지점으로 이동

        else:
            dis += x[i] * 2      # 거리의 2배를 더해주고
            limit = W            # 초기화

    if limit < W:                # 마지막지점
        dis += x[N-1] * 2        # 거리 2배
      
    print(dis)                   # 거리의 합