# 주어진 수 N개 중에서 소수가 몇 개인지 찾아서 출력하는 프로그램을 작성하시오.

# 첫 줄에 수의 개수 N이 주어진다. N은 100이하이다. 다음으로 N개의 수가 주어지는데 수는 1,000 이하의 자연수이다.

N = int(input())                      # 개수 입력
num = list(map(int, input().split())) # 숫자 입력
ans = 0                               # 답

for i in num:                         # 숫자 반복
    if i != 1:                        # 1 이 아니면
        cnt = 0                       # 변수
        for j in range(2, i+1):       # 2부터 i 까지 반복
            if i % j == 0:            # 숫자를 차례대로 나눴을때 나머지가 0 이면
                cnt += 1              # +1
        if cnt == 1:                  # 나눴을때 나머지가 0일때
            ans += 1                  # 그수는 소수이므로 답에 1을 더한다.

print(ans)


