# 쉬운 거스름돈

# 우리나라 화폐 ‘원’은 금액이 높은 돈을 우선적으로 계산할 때 돈의 개수가 가장 최소가 된다.
# S마켓에서 사용하는 돈의 종류는 다음과 같다.
# 50,000 원
# 10,000 원
# 5,000 원
# 1,000 원
# 500 원
# 100 원
# 50 원
# 10 원
# S마켓에서 손님에게 거슬러 주어야 할 금액 N이 입력되면 돈의 최소 개수로 거슬러 주기 위하여 각 종류의 돈이
# 몇 개씩 필요한지 출력하라.

# [제약 사항]
# 1. N은 10이상 1,000,000이하의 정수이다. (10 ≤ N ≤ 1,000,000)
# 2. N의 마지막 자릿수는 항상 0이다. (ex : 32850)
#
# [입력]
# 가장 첫 줄에는 테스트 케이스의 개수 T가 주어지고, 그 아래로 각 테스트 케이스가 주어진다.
# 각 테스트 케이스에는 N이 주어진다.

money = [50000, 10000, 5000, 1000, 500, 100, 50, 10]  # 지폐

T = int(input())                         # case 입력
for tc in range(1, T+1):                 # case 반복
    N = int(input())                     # 돈 입력
    idx = 0                              # index
    ans = [0] * 8                        # 거스름돈의 개수
    while money and idx < 8:             # 인덱스가 8이하일때
        ans[idx] = (N // money[idx])     # 돈나눈 값 추가
        N %= money[idx]                  # 돈 뺴고
        idx += 1                         # 인덱스 증가

    print("#{}".format(tc))
    print(*ans)
