# 정식이의 은행업무

# 삼성은행의 신입사원 정식이는 실수를 저질렀다. 은행 업무가 마감되기 직전인 지금, 송금할 금액을 까먹고 말았다.
# 하지만 다행스럽게도 정식이는 평소 금액을 2진수와 3진수의 두 가지 형태로 기억하고 다니며, 기억이 명확하지 않은
# 지금조차 2진수와 3진수 각각의 수에서 단 한 자리만을 잘못 기억하고 있다는 것만은 알고 있다.
# 예를 들어 현재 기억이 2진수 1010과 3진수 212을 말해주고 있다면 이는 14의 2진수인 1110와 14의 3진수인 112를 잘못
# 기억한 것이라고 추측할 수 있다.정식이는 실수를 바로잡기 위해 당신에게 부탁을 하였다.
# 정식이가 송금액을 추측하는 프로그램을 만들어주자.
# ( 단, 2진수와 3진수의 값은 무조건 1자리씩 틀리다.  추측할 수 없는 경우는 주어지지 않는다. )

# 10개 이하의 테스트 케이스가 주어진다.첫 번째 줄에는 테스트케이스의 개수가 주어진다.
# 하나의 케이스는 두 줄로 되어있다.
# 각 케이스의 첫 번째 줄은 정식이가 기억하는 송금액의 2진수 표현, 두 번째 줄은 송금액의 3진수 표현이 주어진다.
# (3 ≤ 2진수, 3진수의 자릿수 <40)
def check():                                                # check 함수
    bi_num = 0                                              # 2진수 10진수로 바꾸기
    for x in money_2:                                       # 각자리를 받아서
        bi_num = bi_num * 2 + int(x)                        # 10진수로 변경
    for i in range(len(money_2)):                           # 2진수 오류 저장
        binary.append(bi_num ^ (1 << i))                    # XOR 연산으로 1비트씩 쉬프트하면서 추가
    for i in range(len(money_3)):                           # 3진수 10진수로 바꾸기
        num1 = 0                                            # 3진수 오류 경우의 수1
        num2 = 0                                            # 3진수 오류 경우의 수2
        for j in range(len(money_3)):                       # 반복해서
            if i != j:                                      # 10진수로 바꾸고
                num1 = num1 * 3 + int(money_3[j])
                num2 = num2 * 3 + int(money_3[j])
            else:
                num1 = num1 * 3 + (int(money_3[j]) + 1) % 3
                num2 = num2 * 3 + (int(money_3[j]) + 2) % 3
        if num1 in binary:                                  # 경우의수1 이랑 2진수오류랑 같으면
            return num1                                     # 경우의수1 을 반환
        if num2 in binary:                                  # 경우의수2 이랑 2진수오류랑 같으면
            return num2                                     # 겅우의수2 를 반환


T = int(input())                                            # case 입력
for tc in range(1, T+1):                                    # case 반복
    money_2 = input()                                       # 2진수 입력
    money_3 = input()                                       # 3진수 입력
    binary = []
    print("#{} {}".format(tc, check()))