# 숫자의 개수

# 세 개의 자연수 A, B, C가 주어질 때A × B × C를 계산한 결과에 0부터 9까지
# 각각의 숫자가 몇 번씩 쓰였는지를 구하는 프로그램을 작성하시오.
# 예를 들어 A = 150, B = 266, C = 427 이라면 A × B × C = 150 × 266 × 427 = 17037300 이 되고,
# 계산한 결과 17037300 에는 0이 3번, 1이 1번, 3이 2번, 7이 2번 쓰였다.

# 첫째 줄에 A, 둘째 줄에 B, 셋째 줄에 C가 주어진다. A, B, C는 모두 100보다 크거나 같고, 1,000보다 작은 자연수이다.

count = [0] * 10                # 카운트할 리스트 생성
A = int(input())
B = int(input())
C = int(input())
num = A * B * C                 # 세 개의  곱

for i in range(len(str(num))):  # num 의 길이만큼 반복
    count[num % 10] += 1        # 10으로 나눈 나머지를 추가
    num = num // 10             # 10을 나눈 값으로 초기화

for j in range(10):             # 10번 반복해서
    print(count[j])             # 출력
