# 상근이는 요즘 설탕공장에서 설탕을 배달하고 있다. 
# 상근이는 지금 사탕가게에 설탕을 정확하게 N킬로그램을 배달해야 한다.
# 설탕공장에서 만드는 설탕은 봉지에 담겨져 있다. 
# 봉지는 3킬로그램 봉지와 5킬로그램 봉지가 있다.
# 상근이는 귀찮기 때문에, 최대한 적은 봉지를 들고 가려고 한다.
# 예를 들어, 18킬로그램 설탕을 배달해야 할 때, 3킬로그램 봉지 6개를 가져가도 되지만,
# 5킬로그램 3개와 3킬로그램 1개를 배달하면, 더 적은 개수의 봉지를 배달할 수 있다.
# 상근이가 설탕을 정확하게 N킬로그램 배달해야 할 때,
# 봉지 몇 개를 가져가면 되는지 그 수를 구하는 프로그램을 작성하시오.

# 첫째 줄에 N이 주어진다. (3 ≤ N ≤ 5000)

N = int(input())                             # 설탕 키로 수
box_num = 0                                  # 봉지 수 변수

if N%5 == 0:                                 # 5의 배수일 경우
    box_num = N//5                           # 봉지수는 N//5
elif (N%5)%3 == 0 :             #5의 배수x , 5로 나눈 나머지가 3으로 나눠질 경우
    box_num = N//5 + (N%5)//3                #봉지수는 N//5 + 나머지//3 
elif ((N%5)+5)%3 == 0 :         # 5의 배수x , 5로 나눈 나머지에서 5를 더하고 3으로 나눠질 경우
    if N>5:                                  # N이 5보다 클경우
        box_num = ((N//5)-1) + ((N%5)+5)//3  # (N//5)에서 1(=N-5)을 빼고 나머지에 5를 더한 후 3으로 나눈다
    else:                                    # ex) 9 => (9//5)=1   9%5=4,  box_num =  (1 - 1) + (4+5)//3 = 3
        box_num = -1                         # ex) 4 = 4//5 = 0 , 4%5 = 4,  box_num =  (0 - 1) + (4+5)//3 = 2   이건 불가능                 
elif ((N%5)+10)%3 == 0 :        # 5의 배수x, 5로 나눈 나머지에서 10을 더하고 3으로 나눠질 경우   
    if N>10:                                 # N이 5보다 클경우
        box_num = ((N//5)-2) + ((N%5)+10)//3 # (N//5)에서 2(=N-10)을 빼고 나머지에 10를 더한 후 3으로 나눈다
    else:                                    # ex) 12 => (12//5)=2 12%5=2, box_num =  (2 - 2) + (2+10)//3 = 4
        box_num = -1 # 안되는걸 못찾음..
else:
    box_num = -1     # 안되는걸 못찾음..

print(box_num)

## 다른 풀이 ##

