# 나머지

# 두 자연수 A와 B가 있을 때, A%B는 A를 B로 나눈 나머지 이다.
# 예를 들어, 7, 14, 27, 38을 3으로 나눈 나머지는 1, 2, 0, 2이다.
# 수 10개를 입력받은 뒤, 이를 42로 나눈 나머지를 구한다.
# 그 다음 서로 다른 값이 몇 개 있는지 출력하는 프로그램을 작성하시오.

# 첫째 줄부터 열번째 줄 까지 숫자가 한 줄에 하나씩 주어진다. 이 숫자는 1,000보다 작거나 같고, 음이 아닌 정수이다.

num = []                # 나머지를 저장할 리스트
count = [0] * 42        # 카운트할 리스트
cnt = 0                 # 카운트의 개수
for i in range(10):
    N = int(input())    # 10개의 수 입력
    X = N % 42          # 42로 나눈 나머지를
    num.append(X)       # 리스트에 추가
for i in range(42):     # 42까지 돌아서
    if i in num:        # num 같은 값이 있다면
        count[i] += 1   # 그자리의 카운트에 1 추가

for i in count:         # 카운트에서
    if i != 0:          # 0이 아닌 수만
        cnt += 1        # 개수 + 1
print(cnt)

